# 生成DataFrame

In [17]:
import pandas as pd

In [8]:
data={'state':['ohio','ohio','ohio','nevada','nevada','nevada'],
      'year':[2000,2001,2991,2001,2002,2003],
      'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

In [9]:
data

{'state': ['ohio', 'ohio', 'ohio', 'nevada', 'nevada', 'nevada'],
 'year': [2000, 2001, 2991, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [10]:
frame=pd.DataFrame(data)

In [11]:
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2991  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

产生的DataFrame会自动为Series分配索引，并且列会按排序的顺序排列

可以指定列和索引，但是如果传入的列不包含在字典中，就会出现缺失值

In [14]:
frame2=pd.DataFrame(data,columns=['year','state','pop','debt'],index=['one','two','three','four','five','six'])

In [15]:
frame2

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2991    ohio  3.6  NaN
four   2001  nevada  2.4  NaN
five   2002  nevada  2.9  NaN
six    2003  nevada  3.2  NaN

**Daraframe中的缺失值用NaN表示**

# 可以传递包含字典的嵌套字典

In [30]:
pop= {'nevadea':{2001:2.4,2002:2.9},'ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [32]:
frame3=pd.DataFrame(pop)

In [33]:
frame3

      nevadea  ohio
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

可以根据字典型标记检索其中的一列

In [18]:
frame2.year

one      2000
two      2001
three    2991
four     2001
five     2002
six      2003
Name: year, dtype: int64

**只有在列名有效时有用，类似于frame2.eastern无法创建新的列**

# 列内容的修改

可以通过赋值来进行修改

In [21]:
frame2['debt']=16.5

In [22]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5  16.5
two    2001    ohio  1.7  16.5
three  2991    ohio  3.6  16.5
four   2001  nevada  2.4  16.5
five   2002  nevada  2.9  16.5
six    2003  nevada  3.2  16.5

也可以运用Series根据索引进行赋值

In [23]:
val=pd.Series([-1.2,-1.7,-1.5],index=['two','four','five'])

In [24]:
frame2['debt']=val

In [25]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001    ohio  1.7  -1.2
three  2991    ohio  3.6   NaN
four   2001  nevada  2.4  -1.7
five   2002  nevada  2.9  -1.5
six    2003  nevada  3.2   NaN

# 如果被赋值的列不存在则会生成一个新的列

In [26]:
frame2['eastern']=frame2.state=='ohio'

In [27]:
frame2

       year   state  pop  debt  eastern
one    2000    ohio  1.5   NaN     True
two    2001    ohio  1.7  -1.2     True
three  2991    ohio  3.6   NaN     True
four   2001  nevada  2.4  -1.7    False
five   2002  nevada  2.9  -1.5    False
six    2003  nevada  3.2   NaN    False

# **del方法可以移除之前创建的列**

In [28]:
del frame2['eastern']

In [29]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001    ohio  1.7  -1.2
three  2991    ohio  3.6   NaN
four   2001  nevada  2.4  -1.7
five   2002  nevada  2.9  -1.5
six    2003  nevada  3.2   NaN